# pandas

## Notebook Setup <a class="tocSkip">

In [238]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:70% !important; margin-left:350px; }</style>"))

In [27]:
import numpy as np
import pandas as pd
import datetime as dt

## Display Setup
It is good idea to configure output setup as prefered

In [28]:
pd.set_option( 'display.notebook_repr_html', False)  # render Series and DataFrame as text, not HTML
pd.set_option( 'display.max_column', 10)    # number of columns
pd.set_option( 'display.max_rows', 10)     # number of rows
pd.set_option( 'display.width', 80)        # number of characters per row


## Pandas Data Types  

|Type        | Dimension | Size      | Value   | Constructor
|:---------- |:----------|:----------|:--------|:----------------------------------------------------
|Series      | 1         | Immutable | Mutable | pandas.DataFrame( data, index, dtype, copy)  
|DataFrame   | 2         | Mutable   | Mutable | pandas.DataFrame( data, index, columns, dtype, copy)
|Panel       | 3         | Mutable   | Mutable | 

**data** can be ndarray, list, constants  
**index** must be unique and same length as data. Can be integer or string
**dtype** if none, it will be inferred  
**copy** copy data. Default false

## Series

### Creating Series

#### Empty Series
Passing empty parameter result in empty series

In [29]:
s = pd.Series()
print (s)
type(s)

Series([], dtype: float64)

pandas.core.series.Series

#### From Scalar
If data is a scalar value, an **index must be provided**. The **value will be repeated** to match the length of index

In [30]:
pd.Series( 1, index = ['a','b','c','d'])

a    1
b    1
c    1
d    1
dtype: int64

#### From list or np.array
If index is not specified, default to 0 and continue incrementally

In [31]:
pd.Series(np.array(['a','b','c','d','e']))  # from np.array

0    a
1    b
2    c
3    d
4    e
dtype: object

In [32]:
pd.Series(['a','b','c','d','e'])           # from Python list

0    a
1    b
2    c
3    d
4    e
dtype: object

#### From Dictionary
The **dictionary key** will be the index

If **index sequence is not specified**, then the Series will be **automatically sorted** according to the key

In [33]:
pd.Series({'a' : 0., 'c' : 1., 'b' : 2.})  # from Python dict, autosort by default key

a    0.0
b    2.0
c    1.0
dtype: float64

If **index sequence** is specifeid, then Series will forllow the index order  
Objerve that **missing data** (index without value) will be marked as NaN

In [34]:
pd.Series({'a' : 0., 'c' : 1., 'b' : 2.},index = ['a','b','c','d'])  # from Python Dict, index specified, no auto sort

a    0.0
b    2.0
c    1.0
d    NaN
dtype: float64

#### Specify Index During Creation

In [35]:
pd.Series(['a','b','c','d','e'], index=[10,20,30,40,50])

10    a
20    b
30    c
40    d
50    e
dtype: object

### Accessing Series
```
series     ( single/list/range_of_row_label/number ) # can cause confusion
series.loc ( single/list/range_of_row_label )
series.iloc( single/list/range_of_row_number )
```

#### Sample Data

In [36]:
s = pd.Series([1,2,3,4,5],index=['a','b','c','d','e']) 
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

#### Retrieve by Position

**Single Item**

In [37]:
s.iloc[1]

2

**Multiple Items**

In [38]:
s.iloc[[1,3]]

b    2
d    4
dtype: int64

**Range (First 3)**

In [39]:
s.iloc[:3]

a    1
b    2
c    3
dtype: int64

**Range (Last 3)**

In [40]:
s.iloc[-3:]

c    3
d    4
e    5
dtype: int64

**Range (in between)**

In [41]:
s.iloc[2:3]

c    3
dtype: int64

#### Retrieve by Label

**Single Label**

In [42]:
s.loc['c'] 
# or  ... s[['c']]

3

**Multiple Labels**

In [43]:
s.loc[['b','c']]

b    2
c    3
dtype: int64

** Range of Labels **

In [44]:
s.loc['b':'d']

b    2
c    3
d    4
dtype: int64

### Series Properties

#### .index

In [45]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

### Series Functions

#### .reset_index ()
Resetting index will:  
- Convert index to a normal column  
- Index numbering became 0,1,2,3

In [46]:
s.reset_index()

  index  0
0     a  1
1     b  2
2     c  3
3     d  4
4     e  5

In [47]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

### Series Number Operator

The result of applying operator (arithmetic or logic) to Series object **returns a new Series object**

#### Arithmetic Operator

In [48]:
s1 = pd.Series( [100,200,300,400,500] )
s2 = pd.Series( [10, 20, 30, 40, 50] )

**Apply To One Series Object**

In [49]:
100 - s2

0    90
1    80
2    70
3    60
4    50
dtype: int64

**Apply To Two Series Objects**

In [50]:
s1 - s2

0     90
1    180
2    270
3    360
4    450
dtype: int64

#### Logic Operator (Boolean Selection)
- Apply logic operator to a Series return a **new Series** of boolean result  
- This can be used for **dataframe filtering**

In [51]:
bs = pd.Series(range(0,10))
bs

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [52]:
print (bs>3)
print (type (bs>3))

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool
<class 'pandas.core.series.Series'>

In [53]:
~((bs>3) & (bs<8))

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8     True
9     True
dtype: bool

### Series String Operator
- This chapter focus on various functions that can be applied to entire Series data  
```
SeriesObj.str.operatorFunction()
```

In [54]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

#### Case Conversion
```
SeriesObj.str.upper()
SeriesObj.str.lower()
```

In [55]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

#### Number of Characters

In [56]:
s.str.len()

0    1.0
1    1.0
2    1.0
3    4.0
4    4.0
5    NaN
6    4.0
7    3.0
8    3.0
dtype: float64

#### String Indexing

In [57]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan,'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [58]:
s.str[1]  # return char-1 (second char) of every item

0    NaN
1    NaN
2    NaN
3      a
4      a
5    NaN
6      A
7      o
8      a
dtype: object

#### Splitting

**Sample Data**

In [59]:
s = pd.Series(['a_b_c', 'c_d_e', np.nan, 'f_g_h'])

**Splitting base on a a delimieter**
Result is a SeriesObj with list of splitted characters

In [60]:
sp = s.str.split('_')
sp

0    [a, b, c]
1    [c, d, e]
2          NaN
3    [f, g, h]
dtype: object

**Retrieving Split Result**  
Use **.str.get()** to retrieve splitted elments

In [61]:
sp.str.get(-1)

0      c
1      e
2    NaN
3      h
dtype: object

Alternatively, use **str[ ]** for the same result

In [62]:
sp.str[-1]

0      c
1      e
2    NaN
3      h
dtype: object

#### Split and Expand Into DataFrame

In [63]:
s.str.split('_',expand=True, n=5)  # limit expansion into n columns

     0    1    2
0    a    b    c
1    c    d    e
2  NaN  NaN  NaN
3    f    g    h

#### Series Substring Extraction

**Sample Data**

In [64]:
s = pd.Series(['a1', 'b2', 'c3'])
s

0    a1
1    b2
2    c3
dtype: object

**Extract absed on regex matching**  
... to improve ...

In [65]:
type(s.str.extract('([ab])(\d)', expand=False))

pandas.core.frame.DataFrame

### Series DateTime Operator

#### Sample Data

In [66]:
s = pd.Series([
    dt.datetime(2000,1,1,0,0,0),
    dt.datetime(1999,12,15,12,34,55),
    dt.datetime(2020,3,8,5,7,12),
    dt.datetime(2018,1,1,0,0,0),
    dt.datetime(2003,3,4,5,6,7)
])

#### Date Related Extraction
A Series::DateTime object support below properties:  
- date  
- month  
- day  
- year  
- dayofweek  
- dayofyear  
- weekday  
- weekday_name  
- quarter  
- daysinmonth

In [67]:
s.dt.date

0    2000-01-01
1    1999-12-15
2    2020-03-08
3    2018-01-01
4    2003-03-04
dtype: object

In [68]:
s.dt.month

0     1
1    12
2     3
3     1
4     3
dtype: int64

In [69]:
s.dt.dayofweek

0    5
1    2
2    6
3    0
4    1
dtype: int64

In [70]:
s.dt.weekday

0    5
1    2
2    6
3    0
4    1
dtype: int64

In [71]:
s.dt.weekday_name

0     Saturday
1    Wednesday
2       Sunday
3       Monday
4      Tuesday
dtype: object

In [72]:
s.dt.quarter

0    1
1    4
2    1
3    1
4    1
dtype: int64

In [73]:
s.dt.daysinmonth

0    31
1    31
2    31
3    31
4    31
dtype: int64

#### Time Related Extration

In [74]:
s.dt.time   # extract time as time Object

0    00:00:00
1    12:34:55
2    05:07:12
3    00:00:00
4    05:06:07
dtype: object

In [75]:
s.dt.hour  # extract hour as integer

0     0
1    12
2     5
3     0
4     5
dtype: int64

In [76]:
s.dt.minute # extract minute as integer

0     0
1    34
2     7
3     0
4     6
dtype: int64

## DataFrame

### Create DataFrame

#### From Row Oriented Data
Create from **List of Lists**
```
DataFrame( [row_list1, row_list2, row_list3] )
DataFrame( [row_list1, row_list2, row_list3], column=columnName_list )
DataFrame( [row_list1, row_list2, row_list3], index=row_label_list )
```

**Basic DataFrame with default Row Label and Column Header**

In [77]:
pd.DataFrame ([[101,'Alice',40000,2017],
               [102,'Bob',  24000, 2017], 
               [103,'Charles',31000,2017]] )

     0        1      2     3
0  101    Alice  40000  2017
1  102      Bob  24000  2017
2  103  Charles  31000  2017

**Specify Column Header during Creation**

In [78]:
pd.DataFrame ([[101,'Alice',40000,2017],
               [102,'Bob',  24000, 2017], 
               [103,'Charles',31000,2017]], columns = ['empID','name','salary','year'])

   empID     name  salary  year
0    101    Alice   40000  2017
1    102      Bob   24000  2017
2    103  Charles   31000  2017

**Specify Row Label during Creation**

In [79]:
pd.DataFrame ([[101,'Alice',40000,2017],
               [102,'Bob',  24000, 2017], 
               [103,'Charles',31000,2017]], index   = ['r1','r2','r3'] )

      0        1      2     3
r1  101    Alice  40000  2017
r2  102      Bob  24000  2017
r3  103  Charles  31000  2017

#### From Column Oriented Data
Create from **Dictrionary of Lists**
```
DataFrame(  { 'column1': list1,
              'column2': list2,
              'column3': list3 } , 
              index    = row_label_list, 
              columns  = np.arrange)
              
```
By default, DataFrame will **arrange the columns alphabetically**, unless **columns** is specified

**Default Row Label** using Keys

In [80]:
data = {'empID':  [100,      101,    102,      103,     104],
        'year':   [2017,     2017,   2017,      2018,    2018],
        'salary': [40000,    24000,  31000,     20000,   30000],
        'name':   ['Alice', 'Bob',  'Charles', 'David', 'Eric']}
pd.DataFrame(data)

   empID     name  salary  year
0    100    Alice   40000  2017
1    101      Bob   24000  2017
2    102  Charles   31000  2017
3    103    David   20000  2018
4    104     Eric   30000  2018

**Specify Row Label during Creation**

In [81]:
data = {'empID':  [100,      101,    102,      103,     104],
        'name':   ['Alice', 'Bob',  'Charles', 'David', 'Eric'],
        'year':   [2017,     2017,   2017,      2018,    2018],
        'salary': [40000,    24000,  31000,     20000,   30000] }
pd.DataFrame (data, index=['r1','r2','r3','r4','r5'])

    empID     name  salary  year
r1    100    Alice   40000  2017
r2    101      Bob   24000  2017
r3    102  Charles   31000  2017
r4    103    David   20000  2018
r5    104     Eric   30000  2018

### Sample Data
Columns are intentionaly ordered in a messy way

In [82]:
df = pd.DataFrame(
    { 'empID':  [100,      101,    102,      103,     104],
      'year1':   [2017,     2017,   2017,      2018,    2018],
      'name':   ['Alice',  'Bob',  'Charles','David', 'Eric'],
      'year2':   [2001,     1907,   2003,      1998,    2011],
      'salary': [40000,    24000,  31000,     20000,   30000]},
    columns = ['year1','salary','year2','empID','name'])

print (df, '\n')
print (df.index)

   year1  salary  year2  empID     name
0   2017   40000   2001    100    Alice
1   2017   24000   1907    101      Bob
2   2017   31000   2003    102  Charles
3   2018   20000   1998    103    David
4   2018   30000   2011    104     Eric

RangeIndex(start=0, stop=5, step=1)

### Index Manipulation (Row Label)
**index** and **row label** are used interchangeably in this book

#### Getting Index ( .index )

In [83]:
df.index

RangeIndex(start=0, stop=5, step=1)

#### Convert Column To Index
```
set_index('column_name', inplace=False)
```
**inplace=True** means don't create a new dataframe. Modify existing dataframe    
**inplace=False** means return a new dataframe

In [84]:
t = df.set_index('empID') # return new DataFrameObj
t

       year1  salary  year2     name
empID
100     2017   40000   2001    Alice
101     2017   24000   1907      Bob
102     2017   31000   2003  Charles
103     2018   20000   1998    David
104     2018   30000   2011     Eric

In [85]:
t.index

Int64Index([100, 101, 102, 103, 104], dtype='int64', name='empID')

#### Convert Index To Column
- Reseting index will resequence the index as 0,1,2 etc  
- Old index column will be converted back as normal column  
- Operation support inplace** option

In [86]:
t.reset_index(inplace=False)

   empID  year1  salary  year2     name
0    100   2017   40000   2001    Alice
1    101   2017   24000   1907      Bob
2    102   2017   31000   2003  Charles
3    103   2018   20000   1998    David
4    104   2018   30000   2011     Eric

#### Updating Index ( .index= )
**Warning:**  
- Updating index doesn't reorder the data sequence  
- Number of elements before and after reorder must match, otherwise **error**  
- Same label are allowed to repeat
- Not reversable

In [87]:
t.index = [101, 101, 101, 102, 103]
t

     year1  salary  year2     name
101   2017   40000   2001    Alice
101   2017   24000   1907      Bob
101   2017   31000   2003  Charles
102   2018   20000   1998    David
103   2018   30000   2011     Eric

#### Reordering Index (. reindex )
- Reindex will reorder the rows according to new index  
- The operation is not reversable

**Start from this original dataframe**

In [88]:
t.index = [101,102,103,104,105]
t

     year1  salary  year2     name
101   2017   40000   2001    Alice
102   2017   24000   1907      Bob
103   2017   31000   2003  Charles
104   2018   20000   1998    David
105   2018   30000   2011     Eric

**Change the order of Index**

In [89]:
t.reindex([103,102,101,104,105])

     year1  salary  year2     name
103   2017   31000   2003  Charles
102   2017   24000   1907      Bob
101   2017   40000   2001    Alice
104   2018   20000   1998    David
105   2018   30000   2011     Eric

### Column Selection
**Select Single Column** Return **Series**
```
dataframe.columnName               # single column, name based, return Series object
dataframe[ single_col_name ]       # single column, name based, return Series object
```
**Select Single/Multiple Columns** Return **DataFrame**
```
dataframe[ single/list_of_col_names ]                       # name based, return Dataframe object
dataframe.loc [ :, single/list/range_of_column_name ]       # name based, return dataframe object
dataframe.iloc[ :, single/list/range_list_of_col_number  ]  # row number based, return Data Frame object
```

#### Select Single Column
Selecting single column always return as panda::Series

In [90]:
df.name

0      Alice
1        Bob
2    Charles
3      David
4       Eric
Name: name, dtype: object

In [91]:
df['name']

0      Alice
1        Bob
2    Charles
3      David
4       Eric
Name: name, dtype: object

In [92]:
df.loc[:, 'name']

0      Alice
1        Bob
2    Charles
3      David
4       Eric
Name: name, dtype: object

In [93]:
df.iloc[:, 0]

0    2017
1    2017
2    2017
3    2018
4    2018
Name: year1, dtype: int64

#### Getting Multiple Columns
Multiple columns return as **panda::Dataframe** object`

In [94]:
df[['name','year1']]

      name  year1
0    Alice   2017
1      Bob   2017
2  Charles   2017
3    David   2018
4     Eric   2018

In [95]:
df.loc[:,['name','year']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.
C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1367: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

      name  year
0    Alice   NaN
1      Bob   NaN
2  Charles   NaN
3    David   NaN
4     Eric   NaN

In [96]:
df.loc[:,'name':'year1']

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [97]:
df.iloc[:,[0,3]]

   year1  empID
0   2017    100
1   2017    101
2   2017    102
3   2018    103
4   2018    104

In [98]:
df.iloc[:,0:3]

   year1  salary  year2
0   2017   40000   2001
1   2017   24000   1907
2   2017   31000   2003
3   2018   20000   1998
4   2018   30000   2011

#### Selection by Data Type

```
df.select_dtypes(include=None, exclude=None)
```
Always return **panda::DataFrame**, even though only single column matches.  
Allowed types are:
- number (integer and float)  
- integer / float 
- datetime  
- timedelta  
- category

In [99]:
df.get_dtype_counts()

int64     4
object    1
dtype: int64

In [100]:
df.select_dtypes(exclude='number')

      name
0    Alice
1      Bob
2  Charles
3    David
4     Eric

#### Selection by Name Filter
**like = Substring Matches**

In [101]:
df.filter(like='year')

   year1  year2
0   2017   2001
1   2017   1907
2   2017   2003
3   2018   1998
4   2018   2011

**regex = Regular Expression**  
Select column names that contain integer

In [102]:
df.filter(regex='\d')

   year1  year2
0   2017   2001
1   2017   1907
2   2017   2003
3   2018   1998
4   2018   2011

### Column Manipulation

#### Sample Data

In [103]:
df

   year1  salary  year2  empID     name
0   2017   40000   2001    100    Alice
1   2017   24000   1907    101      Bob
2   2017   31000   2003    102  Charles
3   2018   20000   1998    103    David
4   2018   30000   2011    104     Eric

#### Renaming Columns

**Method 1 : Rename All Columns (columns =)**  
- Construct the new column names, **check if there is no missing** column names   
- **Missing columns** will return **error**  
- Direct Assignment to column property result in change to dataframe

In [104]:
new_columns = ['year.1','salary','year.2','empID','name']
print( len(new_columns) == len(df.columns) )
df.columns = new_columns
df.head(2)

True

   year.1  salary  year.2  empID   name
0    2017   40000    2001    100  Alice
1    2017   24000    1907    101    Bob

**Method 2 : Renaming Specific Column (rename (columns=) )** 
- Change column name through **rename** function  
- Support **inpalce** option for original dataframe change  
- Missing column is OK

In [105]:
df.rename( columns={'year.1':'year1', 'year.2':'year2'}, inplace=True)
df.head(2)

   year1  salary  year2  empID   name
0   2017   40000   2001    100  Alice
1   2017   24000   1907    101    Bob

#### Reordering Columns
Always return a new dataframe.  There is **no inplace option** for reordering columns  

**Method 1 - reindex(columns = )**  
- **reindex** may sounds like operation on row labels, but it works  
- **Missmatch** column names will result in **NA** for the unfound column

In [106]:
new_colorder = [ 'empID', 'name', 'salary', 'year1', 'year2']
df.reindex(columns = new_colorder).head(2)

   empID   name  salary  year1  year2
0    100  Alice   40000   2017   2001
1    101    Bob   24000   2017   1907

**Method 2 - [ ] notation**  
- **Missmatch** column will result in **ERROR**

In [107]:
new_colorder = [ 'empID', 'name', 'salary', 'year1', 'year2']
df[new_colorder]

   empID     name  salary  year1  year2
0    100    Alice   40000   2017   2001
1    101      Bob   24000   2017   1907
2    102  Charles   31000   2017   2003
3    103    David   20000   2018   1998
4    104     Eric   30000   2018   2011

#### Duplicating Column
- **New Column** will be created instantly using **[] notation**  
- **DO NOT USE dot Notation** because it is view only attribute

In [108]:
df['year3'] = df.year1
df

   year1  salary  year2  empID     name  year3
0   2017   40000   2001    100    Alice   2017
1   2017   24000   1907    101      Bob   2017
2   2017   31000   2003    102  Charles   2017
3   2018   20000   1998    103    David   2018
4   2018   30000   2011    104     Eric   2018

#### Dropping Columns (.drop)
```
dataframe.drop( columns='column_name',    inplace=True/False)   # delete single column
dataframe.drop( columns=list_of_colnames, inplace=True/False)   # delete multiple column

dataframe.drop( index='row_label',         inplace=True/False)   # delete single row
dataframe.drop( index= list_of_row_labels, inplace=True/False)   # delete multiple rows

```
**inplace=True** means column will be deleted from original dataframe. **Default is False**, which return a copy of dataframe

**By Column Name(s)**

In [109]:
df.drop( columns='year1') # drop single column

   salary  year2  empID     name  year3
0   40000   2001    100    Alice   2017
1   24000   1907    101      Bob   2017
2   31000   2003    102  Charles   2017
3   20000   1998    103    David   2018
4   30000   2011    104     Eric   2018

In [110]:
df.drop(columns=['year2','year3'])  # drop multiple columns

   year1  salary  empID     name
0   2017   40000    100    Alice
1   2017   24000    101      Bob
2   2017   31000    102  Charles
3   2018   20000    103    David
4   2018   30000    104     Eric

**By Column Number(s)**   
Use dataframe.columns to produce interim list of column names

In [111]:
df.drop( columns=df.columns[[3,4,5]] )   # delete columns by list of column number

   year1  salary  year2
0   2017   40000   2001
1   2017   24000   1907
2   2017   31000   2003
3   2018   20000   1998
4   2018   30000   2011

In [112]:
df.drop( columns=df.columns[3:6] )       # delete columns by range of column number

   year1  salary  year2
0   2017   40000   2001
1   2017   24000   1907
2   2017   31000   2003
3   2018   20000   1998
4   2018   30000   2011

### Row Selection
```
dataframe[ range_of_row_numbers ]  # always return dataframe
dataframe.loc [ single/list/range_of_row_labels  ]    # by row label(s), return Series if single row, else Dataframe
dataframe.iloc[ single/list/range_of_row_numbers ]    # by row number(s), return Series if single row, else Dataframe
dataframe.sample(frac=) # frac = 0.6 means sampling 60% of rows randomly
```

#### Sample Data

In [113]:
df = df [new_colorder]
df.set_index('empID',inplace=True)
df

          name  salary  year1  year2
empID
100      Alice   40000   2017   2001
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003
103      David   20000   2018   1998
104       Eric   30000   2018   2011

#### Getting Single Row

Return **new Series** object, with **columns header as Index**

In [114]:
df.loc[102]  # by single row label

name      Charles
salary      31000
year1        2017
year2        2003
Name: 102, dtype: object

In [115]:
df.iloc[2]  # by single row number

name      Charles
salary      31000
year1        2017
year2        2003
Name: 102, dtype: object

#### Getting Multiple Rows

Multiple rows **returned as dataframe** object

In [116]:
df[0:4]

          name  salary  year1  year2
empID
100      Alice   40000   2017   2001
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003
103      David   20000   2018   1998

In [117]:
df.loc[ [100,103] ]  # by row labels

        name  salary  year1  year2
empID
100    Alice   40000   2017   2001
103    David   20000   2018   1998

In [118]:
df.loc[  100:103  ]  # by row label range

          name  salary  year1  year2
empID
100      Alice   40000   2017   2001
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003
103      David   20000   2018   1998

In [119]:
df.iloc[ [0,3] ]    # by row numbers

        name  salary  year1  year2
empID
100    Alice   40000   2017   2001
103    David   20000   2018   1998

In [120]:
df.iloc[  0:3  ]    # by row number range

          name  salary  year1  year2
empID
100      Alice   40000   2017   2001
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003

#### Row Sampling

In [121]:
np.random.seed(15)
df.sample(frac=0.6) #randomly pick 60% of rows, without replacement

          name  salary  year1  year2
empID
102    Charles   31000   2017   2003
103      David   20000   2018   1998
104       Eric   30000   2018   2011

### Row Manipulation

#### Sample Data

In [122]:
df

          name  salary  year1  year2
empID
100      Alice   40000   2017   2001
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003
103      David   20000   2018   1998
104       Eric   30000   2018   2011

#### Dropping Rows (.drop)

**By Row Label(s)**

In [123]:
df.drop(index=100, inplace=False)       # single row

          name  salary  year1  year2
empID
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003
103      David   20000   2018   1998
104       Eric   30000   2018   2011

In [124]:
df.drop(index=[100,103], inplace=False)   # multiple rows

          name  salary  year1  year2
empID
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003
104       Eric   30000   2018   2011

### Slicing

#### Sample Data

In [125]:
df

          name  salary  year1  year2
empID
100      Alice   40000   2017   2001
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003
103      David   20000   2018   1998
104       Eric   30000   2018   2011

#### Getting One Cell  
**By Row Label and Column Name (loc)**

```
dataframe.loc [ row_label , col_name   ]    # by row label and column names
dataframe.iloc[ row_number, col_number ]    # by row and column number
```

In [126]:
print (df.loc[100,'year1'])

2017

**By Row Number and Column Number (iloc)**

In [127]:
print (df.iloc[1,2])

2017

#### Getting Multiple Cells (Slicing)
Specify rows and columns (by individual or range)

```
dataframe.loc [ list/range_of_row_labels , list/range_col_names   ]    # by row label and column names
dataframe.iloc[ list/range_row_numbers,    list/range_col_numbers ]    # by row number
```

**By Index and Column Name (loc)**

In [128]:
print (df.loc[ [101,103], ['name','year1'] ], '\n')  # by list of row label and column names
print (df.loc[  101:104 ,  'name':'year1'  ], '\n')  # by range of row label and column names

        name  year1
empID
101      Bob   2017
103    David   2018

          name  salary  year1
empID
101        Bob   24000   2017
102    Charles   31000   2017
103      David   20000   2018
104       Eric   30000   2018

**By Row and Column Number (iloc)**

In [129]:
print (df.iloc[ [1,3], [1,3]],'\n' )   # by individual rows/columns
print (df.iloc[  1:3 ,  1:3], '\n')    # by range

       salary  year2
empID
101     24000   1907
103     20000   1998

       salary  year1
empID
101     24000   2017
102     31000   2017

#### Boolean Slicing

Indexing a dataframe with boolean series/list will filter rows that are True
```
dataframe[ boolean_list ]
```

In [130]:
criteria = (df.salary > 30000) & (df.year1==2017)
print (df[criteria])

          name  salary  year1  year2
empID
100      Alice   40000   2017   2001
102    Charles   31000   2017   2003

### Sliced Dataframe Referencing (Chained Indexing)

**Chained Index** Method creates a copy of dataframe, any modification of data on original dataframe does not affect the copy  
```
dataframe.loc  [list/range_of_row_label]   [list/range_of_column_names]
dataframe.iloc [list/range_of_row_numbers] [list/range_of_column_numbers]
```

In [131]:
## todo

Use normal method below. Any changes to original data will affect the new dataframe

In [132]:
## todo

### Data Structure

#### Sample Data

In [133]:
df

          name  salary  year1  year2
empID
100      Alice   40000   2017   2001
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003
103      David   20000   2018   1998
104       Eric   30000   2018   2011

#### Structure
Find out the column names, data type in a summary. Output is for display only, not a data object

In [134]:
df.info()  # return text output

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 100 to 104
Data columns (total 4 columns):
name      5 non-null object
salary    5 non-null int64
year1     5 non-null int64
year2     5 non-null int64
dtypes: int64(3), object(1)
memory usage: 360.0+ bytes

In [135]:
df.get_dtype_counts() # return Series

int64     3
object    1
dtype: int64

#### Columns

In [136]:
df.columns # pandas Index object

Index(['name', 'salary', 'year1', 'year2'], dtype='object')

In [137]:
df.columns.values # underlying values are numpy.ndarray

array(['name', 'salary', 'year1', 'year2'], dtype=object)

#### Index

In [138]:
df.index # pandas Index object

Int64Index([100, 101, 102, 103, 104], dtype='int64', name='empID')

In [139]:
df.index.values   # underlying values are numpy.ndarray

array([100, 101, 102, 103, 104], dtype=int64)

#### Dimension

In [140]:
df.ndim   # number of dimension

2

In [141]:
df.shape  # tuple

(5, 4)

**Total number of rows**  
Unfortunately there is no single property to find this out, we have to use count the len() of index object, or second item of shape[0] tuple

In [142]:
len(df.index)

5

In [143]:
df.shape[0]

5

**Total number of columns**  
Unfortunately there is no single property to find out this, use len(column) or shape[1]

In [144]:
len(df.columns)

4

In [145]:
df.shape[1]

4

#### Data Values

In [146]:
df.values # numpy.ndarray

array([['Alice', 40000, 2017, 2001],
       ['Bob', 24000, 2017, 1907],
       ['Charles', 31000, 2017, 2003],
       ['David', 20000, 2018, 1998],
       ['Eric', 30000, 2018, 2011]], dtype=object)

### Exploratory Analysis

#### Sample Data

In [147]:
df

          name  salary  year1  year2
empID
100      Alice   40000   2017   2001
101        Bob   24000   2017   1907
102    Charles   31000   2017   2003
103      David   20000   2018   1998
104       Eric   30000   2018   2011

#### All Stats in One  - .describe()

```
df.describe(include='number') # default
df.describe(include='object') # display for non-numeric columns
df.describe(include='all')    # display both numeric and non-numeric
```

When applied to DataFrame object, describe shows all **basic statistic** for **all numeric** columns:
- Count (non-NA)  
- Unique (for string)  
- Top (for string)   
- Frequency (for string)  
- Percentile  
- Mean  
- Min / Max  
- Standard Deviation

**For Numeric Columns only**  
You can **customize the percentiles requred**. Notice 0.5 percentile is always there although not specified

In [148]:
df.describe()

             salary        year1        year2
count      5.000000     5.000000     5.000000
mean   29000.000000  2017.400000  1984.000000
std     7615.773106     0.547723    43.312816
min    20000.000000  2017.000000  1907.000000
25%    24000.000000  2017.000000  1998.000000
50%    30000.000000  2017.000000  2001.000000
75%    31000.000000  2018.000000  2003.000000
max    40000.000000  2018.000000  2011.000000

In [149]:
df.describe(percentiles=[0.9,0.3,0.2,0.1])

             salary        year1        year2
count      5.000000     5.000000     5.000000
mean   29000.000000  2017.400000  1984.000000
std     7615.773106     0.547723    43.312816
min    20000.000000  2017.000000  1907.000000
10%    21600.000000  2017.000000  1943.400000
20%    23200.000000  2017.000000  1979.800000
30%    25200.000000  2017.000000  1998.600000
50%    30000.000000  2017.000000  2001.000000
90%    36400.000000  2018.000000  2007.800000
max    40000.000000  2018.000000  2011.000000

**For both Numeric and Object**

In [150]:
df.describe(include='all')

         name   salary   year1   year2
count       5      5.0     5.0     5.0
unique      5      NaN     NaN     NaN
top     David      NaN     NaN     NaN
freq        1      NaN     NaN     NaN
mean      NaN  29000.0  2017.4  1984.0
...       ...      ...     ...     ...
min       NaN  20000.0  2017.0  1907.0
25%       NaN  24000.0  2017.0  1998.0
50%       NaN  30000.0  2017.0  2001.0
75%       NaN  31000.0  2018.0  2003.0
max       NaN  40000.0  2018.0  2011.0

[11 rows x 4 columns]

#### min/max/mean/median

In [151]:
df.min()  # default axis=0, column-wise

name      Alice
salary    20000
year1      2017
year2      1907
dtype: object

In [152]:
df.min(axis=1) # axis=1, row-wise

empID
100    2001
101    1907
102    2003
103    1998
104    2011
dtype: int64

Observe, sum on **string will concatenate column-wise**, whereas row-wise only sum up numeric fields

In [153]:
df.sum(0)

name      AliceBobCharlesDavidEric
salary                      145000
year1                        10087
year2                         9920
dtype: object

In [154]:
df.sum(1)

empID
100    44018
101    27924
102    35020
103    24016
104    34029
dtype: int64

### Filtering

In [155]:
data = {'name': ['Alice', 'Bob', 'Charles', 'David', 'Eric'],
        'year': [2017, 2017, 2017, 2018, 2018],
        'salary': [40000, 24000, 31000, 20000, 30000]}
 
df = pd.DataFrame(data, index = ['Acme', 'Acme', 'Bilbao', 'Bilbao', 'Bilbao'])
df

           name  salary  year
Acme      Alice   40000  2017
Acme        Bob   24000  2017
Bilbao  Charles   31000  2017
Bilbao    David   20000  2018
Bilbao     Eric   30000  2018

#### Filter Using Query
```
dataframe.query( 'bool_expression' )  # return a new dataframe
```

In [156]:
df.query('salary>30000 & year==2017')

           name  salary  year
Acme      Alice   40000  2017
Bilbao  Charles   31000  2017

#### Filter Using Indexing, Chain Method
```
dataframe[ bool_expressions ]
```

In [157]:
df[(df.salary >= 30000) & (df.year == 2017)]

           name  salary  year
Acme      Alice   40000  2017
Bilbao  Charles   31000  2017

## Categories

### Creating

#### From List
**Basic (Auto Category Mapping)**  
Basic syntax return categorical index with sequence with code 0,1,2,3... mapping to first found category   
In this case, **low(0), high(1), medium(2)**

In [158]:
temp = ['low','high','medium','high','high','low','medium','medium','high']
temp_cat = pd.Categorical(temp)
temp_cat

[low, high, medium, high, high, low, medium, medium, high]
Categories (3, object): [high, low, medium]

In [159]:
type( temp_cat )

pandas.core.categorical.Categorical

**Manual Category Mapping**  
During creation, we can specify mapping of codes to category: **low(0), medium(1), high(2)**

In [160]:
temp_cat = pd.Categorical(temp, categories=['low','medium','high'])
temp_cat

[low, high, medium, high, high, low, medium, medium, high]
Categories (3, object): [low, medium, high]

#### From Series
- We can 'add' categorical structure into a Series. With these methods, additional property (.cat) is added as a **categorical accessor**  
- Through this accessor, you gain access to various properties of the category such as .codes, .categories. But not .get_values() as the information is in the Series itself  
- Can we manual map category ?????

In [161]:
temp = ['low','high','medium','high','high','low','medium','medium','high']
temp_cat = pd.Series(temp, dtype='category')
print (type(temp_cat))       # Series object
print (type(temp_cat.cat))   # Categorical Accessor

<class 'pandas.core.series.Series'>
<class 'pandas.core.categorical.CategoricalAccessor'>

- Method below has the same result as above by using **.astype('category')**  
- It is useful adding category structure into existing series.

In [162]:
temp_ser = pd.Series(temp)
temp_cat = pd.Series(temp).astype('category')
print (type(temp_cat))       # Series object
print (type(temp_cat.cat))   # Categorical Accessor

<class 'pandas.core.series.Series'>
<class 'pandas.core.categorical.CategoricalAccessor'>

In [163]:
temp_cat.cat.categories

Index(['high', 'low', 'medium'], dtype='object')

#### Ordering Category

In [164]:
temp = ['low','high','medium','high','high','low','medium','medium','high']
temp_cat = pd.Categorical(temp, categories=['low','medium','high'], ordered=True)
temp_cat

[low, high, medium, high, high, low, medium, medium, high]
Categories (3, object): [low < medium < high]

In [165]:
temp_cat.get_values()

array(['low', 'high', 'medium', 'high', 'high', 'low', 'medium', 'medium',
       'high'], dtype=object)

In [166]:
temp_cat.codes

array([0, 2, 1, 2, 2, 0, 1, 1, 2], dtype=int8)

In [167]:
temp_cat[0] < temp_cat[3]

False

### Properties

#### .categories
first element's code = 0  
second element's code = 1  
third element's code = 2

In [168]:
temp_cat.categories

Index(['low', 'medium', 'high'], dtype='object')

#### .codes
Codes are actual **integer** value stored as array. 1 represent 'high',

In [169]:
temp_cat.codes

array([0, 2, 1, 2, 2, 0, 1, 1, 2], dtype=int8)

### Rename Category

#### Renamce To New Category Object
**.rename_categories()** method return a new category object with new changed categories

In [170]:
temp = ['low','high','medium','high','high','low','medium','medium','high']
new_temp_cat = temp_cat.rename_categories(['sejuk','sederhana','panas'])
new_temp_cat

[sejuk, panas, sederhana, panas, panas, sejuk, sederhana, sederhana, panas]
Categories (3, object): [sejuk < sederhana < panas]

In [171]:
temp_cat   # original category object categories not changed

[low, high, medium, high, high, low, medium, medium, high]
Categories (3, object): [low < medium < high]

#### Rename Inplace
Observe the original categories had been changed using **.rename()**

In [172]:
temp_cat.categories = ['sejuk','sederhana','panas']
temp_cat   # original category object categories is changed

[sejuk, panas, sederhana, panas, panas, sejuk, sederhana, sederhana, panas]
Categories (3, object): [sejuk < sederhana < panas]

### Adding New Category
This return a new category object with added categories

In [173]:
temp_cat_more = temp_cat.add_categories(['susah','senang'])
temp_cat_more

[sejuk, panas, sederhana, panas, panas, sejuk, sederhana, sederhana, panas]
Categories (5, object): [sejuk < sederhana < panas < susah < senang]

### Removing Category
This is **not in place**, hence return a new categorical object

#### Remove Specific Categor(ies)
Elements with its category removed will become **NaN**

In [174]:
temp = ['low','high','medium','high','high','low','medium','medium','high']
temp_cat = pd.Categorical(temp)
temp_cat_removed = temp_cat.remove_categories('low')
temp_cat_removed

[NaN, high, medium, high, high, NaN, medium, medium, high]
Categories (2, object): [high, medium]

#### Remove Unused Category
Since categories removed are not used, there is no impact to the element

In [175]:
print (temp_cat_more)
temp_cat_more.remove_unused_categories()

[sejuk, panas, sederhana, panas, panas, sejuk, sederhana, sederhana, panas]
Categories (5, object): [sejuk < sederhana < panas < susah < senang]

[sejuk, panas, sederhana, panas, panas, sejuk, sederhana, sederhana, panas]
Categories (3, object): [sejuk < sederhana < panas]

### Add and Remove Categories In One Step - Set()

In [176]:
temp = ['low','high','medium','high','high','low','medium','medium','high']
temp_cat = pd.Categorical(temp, ordered=True)
temp_cat

[low, high, medium, high, high, low, medium, medium, high]
Categories (3, object): [high < low < medium]

In [177]:
temp_cat.set_categories(['low','medium','sederhana','susah','senang'])

[low, NaN, medium, NaN, NaN, low, medium, medium, NaN]
Categories (5, object): [low < medium < sederhana < susah < senang]

### Categorical Descriptive Analysis

#### At One Glance

In [178]:
temp_cat.describe()

            counts     freqs
categories
high             4  0.444444
low              2  0.222222
medium           3  0.333333

#### Frequency Count

In [179]:
temp_cat.value_counts()

high      4
low       2
medium    3
dtype: int64

#### Least Frequent Category, Most Frequent Category, and Most Frequent Category

In [180]:
( temp_cat.min(), temp_cat.max(), temp_cat.mode() )

('high', 'medium', [high]
 Categories (3, object): [high < low < medium])

### Other Methods

#### .get_values()
Since actual value stored by categorical object are integer **codes**, get_values() function return values translated from *.codes** property

In [181]:
temp_cat.get_values()  #array

array(['low', 'high', 'medium', 'high', 'high', 'low', 'medium', 'medium',
       'high'], dtype=object)

## Dummies

- **get_dummies** creates columns for each categories 
- The underlying data can be string or pd.Categorical  
- It produces a **new pd.DataFrame**

### Sample Data

In [182]:
df = pd.DataFrame (
    {'A': ['A1', 'A2', 'A3','A1','A3','A1'], 
     'B': ['B1','B2','B3','B1','B1','B3'],
     'C': ['C1','C2','C3','C1',np.nan,np.nan]})
df

    A   B    C
0  A1  B1   C1
1  A2  B2   C2
2  A3  B3   C3
3  A1  B1   C1
4  A3  B1  NaN
5  A1  B3  NaN

### Dummies on Array-Like Data

In [183]:
pd.get_dummies(df.A)

   A1  A2  A3
0   1   0   0
1   0   1   0
2   0   0   1
3   1   0   0
4   0   0   1
5   1   0   0

### Dummies on DataFrame (multiple columns)

#### All Columns

In [184]:
pd.get_dummies(df)

   A_A1  A_A2  A_A3  B_B1  B_B2  B_B3  C_C1  C_C2  C_C3
0     1     0     0     1     0     0     1     0     0
1     0     1     0     0     1     0     0     1     0
2     0     0     1     0     0     1     0     0     1
3     1     0     0     1     0     0     1     0     0
4     0     0     1     1     0     0     0     0     0
5     1     0     0     0     0     1     0     0     0

#### Selected Columns

In [185]:
cols = ['A','B']
pd.get_dummies(df[cols])

   A_A1  A_A2  A_A3  B_B1  B_B2  B_B3
0     1     0     0     1     0     0
1     0     1     0     0     1     0
2     0     0     1     0     0     1
3     1     0     0     1     0     0
4     0     0     1     1     0     0
5     1     0     0     0     0     1

### Dummies with na
By default, nan values are ignored

In [186]:
pd.get_dummies(df.C)

   C1  C2  C3
0   1   0   0
1   0   1   0
2   0   0   1
3   1   0   0
4   0   0   0
5   0   0   0

**Make NaN as a dummy variable**

In [187]:
pd.get_dummies(df.C,dummy_na=True)

   C1  C2  C3  NaN
0   1   0   0    0
1   0   1   0    0
2   0   0   1    0
3   1   0   0    0
4   0   0   0    1
5   0   0   0    1

### Specify Prefixes

In [188]:
pd.get_dummies(df.A, prefix='col')

   col_A1  col_A2  col_A3
0       1       0       0
1       0       1       0
2       0       0       1
3       1       0       0
4       0       0       1
5       1       0       0

In [189]:
pd.get_dummies(df[cols], prefix=['colA','colB'])

   colA_A1  colA_A2  colA_A3  colB_B1  colB_B2  colB_B3
0        1        0        0        1        0        0
1        0        1        0        0        1        0
2        0        0        1        0        0        1
3        1        0        0        1        0        0
4        0        0        1        1        0        0
5        1        0        0        0        0        1

### Dropping First Column
- Dummies cause **colinearity issue** for regression as it has redundant column.  
- Dropping a column **does not loose any information** technically

In [190]:
pd.get_dummies(df[cols],drop_first=True)

   A_A2  A_A3  B_B2  B_B3
0     0     0     0     0
1     1     0     1     0
2     0     1     0     1
3     0     0     0     0
4     0     1     0     0
5     0     0     0     1

## Getting External Data

### html_table parser

- Read the web page, create a list: which contain one or more dataframes that maps to each html table found
- Auto detect column header
- Auto create index using number starting from 0
```
read_html(url)  # return list of dataframe(s) that maps to web table(s) structure
```

In [191]:
df_list = pd.read_html('https://www.bloomberg.com/markets/currencies')
print ('Total Table(s) Found : ', len(df_list))
df = df_list[0]
print (df)

Total Table(s) Found :  1
   Currency      Value  Change Net Change Time (EDT)  2 Day
0   EUR-USD     1.2301  0.0031     +0.25%   11:00 AM    NaN
1   USD-JPY   106.5400 -0.0700     -0.07%   11:00 AM    NaN
2   GBP-USD     1.4084  0.0027     +0.19%   11:00 AM    NaN
3   AUD-USD     0.7701  0.0016     +0.21%   11:00 AM    NaN
4   USD-CAD     1.2821  0.0014     +0.11%   11:00 AM    NaN
..      ...        ...     ...        ...        ...    ...
6   EUR-JPY   131.0600  0.2500     +0.19%   11:00 AM    NaN
7   EUR-GBP     0.8733  0.0005     +0.06%   11:00 AM    NaN
8   USD-HKD     7.8493  0.0008     +0.01%   11:00 AM    NaN
9   EUR-CHF     1.1800  0.0034     +0.29%   11:00 AM    NaN
10  USD-KRW  1059.7000  4.9900     +0.47%    2:29 AM    NaN

[11 rows x 6 columns]

### CSV Import

#### Syntax
```
pandas.read_csv( 
    'url or filePath',                     # path to file or url 
    encoding    = 'utf_8',                 # optional: default is 'utf_8'
    index_col   = ['colName1', ...],       # optional: specify one or more index column
    parse_dates = ['dateCol1', ...],       # optional: specify multiple string column to convert to date
    na_values   = ['.','na','NA','N/A'],   # optional: values that is considered NA
    names       = ['newColName1', ... ],   # optional: overwrite column names
    thousands   = '.',                     # optional: thousand seperator symbol
    nrows       = n,                       # optional: load only first n rows
    skiprows    = 0                        # optional: don't load first n rows
)
```
Refer to full codec [Python Codec](https://docs.python.org/3/library/codecs.html#standard-encodings).

#### Basic Import
**By default:**  
- index is sequence of integer 0,1,2...  
- only two data type: number and string
- date is not parsed, hence stayed as string

In [192]:
goo = pd.read_csv('data/goog.csv', encoding='utf_8')

In [193]:
goo.head()

         Date        Open        High         Low       Close   Volume
0  12/19/2016  790.219971  797.659973  786.270020  794.200012  1225900
1  12/20/2016  796.760010  798.650024  793.270020  796.419983   925100
2  12/21/2016  795.840027  796.676025  787.099976  794.559998  1208700
3  12/22/2016  792.359985  793.320007  788.580017  791.260010   969100
4  12/23/2016  790.900024  792.739990  787.280029  789.909973   623400

In [194]:
goo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 6 columns):
Date      61 non-null object
Open      61 non-null float64
High      61 non-null float64
Low       61 non-null float64
Close     61 non-null float64
Volume    61 non-null int64
dtypes: float64(4), int64(1), object(1)
memory usage: 2.9+ KB

#### On The Fly Index and Date Parsing

In [195]:
goo2 = pd.read_csv('data/goog.csv',index_col='Date', parse_dates=['Date'])

In [196]:
goo2.head()

                  Open        High         Low       Close   Volume
Date
2016-12-19  790.219971  797.659973  786.270020  794.200012  1225900
2016-12-20  796.760010  798.650024  793.270020  796.419983   925100
2016-12-21  795.840027  796.676025  787.099976  794.559998  1208700
2016-12-22  792.359985  793.320007  788.580017  791.260010   969100
2016-12-23  790.900024  792.739990  787.280029  789.909973   623400

**Observe index is now DateTime data type**

In [197]:
goo2.index[:3]

DatetimeIndex(['2016-12-19', '2016-12-20', '2016-12-21'], dtype='datetime64[ns]', name='Date', freq=None)

## Frequency Table (crosstab)

crosstab returns **Dataframe Object**
```
crosstab( index = <SeriesObj>, columns = <colName> )                    # one dimension table
crosstab( index = <SeriesObj>, columns = <SeriesObj> )                  # two dimension table
crosstab( index = <SeriesObj>, columns = [<SeriesObj1>, <SeriesObj2>] ) # multi dimension table   
crosstab( index = <SeriesObj>, columns = <SeriesObj>, margines=True )   # add column and row margins
```

### Sample Data

In [198]:
n = 200
comp = ['C' + i for i in np.random.randint( 1,4, size  = n).astype(str)] # 3x Company
dept = ['D' + i for i in np.random.randint( 1,6, size  = n).astype(str)] # 5x Department
grp =  ['G' + i for i in np.random.randint( 1,3, size  = n).astype(str)] # 2x Groups
value1 = np.random.normal( loc=50 , scale=5 , size = n)
value2 = np.random.normal( loc=20 , scale=3 , size = n)
value3 = np.random.normal( loc=5 , scale=30 , size = n)

mydf = pd.DataFrame({
    'comp':comp, 
    'dept':dept, 
    'grp': grp,
    'value1':value1, 
    'value2':value2,
    'value3':value3 })
mydf.head()

  comp dept grp     value1     value2     value3
0   C1   D3  G2  45.132603  20.170157   6.740557
1   C1   D3  G2  46.180146  19.885813  -7.651088
2   C2   D2  G2  54.856648  17.716647 -22.138893
3   C3   D4  G1  56.956977  20.149642  33.682010
4   C2   D2  G1  50.188809  22.869554  64.539563

### One DimensionTable

In [199]:
pd.crosstab(index=mydf.comp, columns='counter')

col_0  counter
comp
C1          78
C2          62
C3          60

In [200]:
type(pd.crosstab(index=mydf.comp, columns='counter'))

pandas.core.frame.DataFrame

### Two Dimension Table

In [201]:
pd.crosstab(index=mydf.comp, columns=mydf.dept)

dept  D1  D2  D3  D4  D5
comp
C1    13  13  17  21  14
C2     9  13  13  17  10
C3    12  13  10  13  12

### Higher Dimension Table

In [202]:
tb = pd.crosstab(index=mydf.comp, columns=[mydf.dept, mydf.grp])
tb

dept D1    D2    D3      D4     D5
grp  G1 G2 G1 G2 G1  G2  G1  G2 G1 G2
comp
C1    7  6  6  7  7  10   9  12  7  7
C2    5  4  6  7  6   7  10   7  3  7
C3    4  8  8  5  3   7   4   9  4  8

Get the **subtable** under D2

In [203]:
tb['D2']

grp   G1  G2
comp
C1     6   7
C2     6   7
C3     8   5

### Getting Margin
New column and row labeled 'All' will be created

In [204]:
tb = pd.crosstab(index=mydf.dept, columns=mydf.grp, margins=True)
tb

grp   G1   G2  All
dept
D1    16   18   34
D2    20   19   39
D3    16   24   40
D4    23   28   51
D5    14   22   36
All   89  111  200

In [205]:
tb['All']   # row total, return a Series

dept
D1      34
D2      39
D3      40
D4      51
D5      36
All    200
Name: All, dtype: int64

In [206]:
tb.loc['All'] # column total, return a Series

grp
G1      89
G2     111
All    200
Name: All, dtype: int64

### Getting Proportion
Use matrix operation divide for each cells over the margin

In [207]:
tb/tb.loc['All']

grp         G1        G2    All
dept
D1    0.179775  0.162162  0.170
D2    0.224719  0.171171  0.195
D3    0.179775  0.216216  0.200
D4    0.258427  0.252252  0.255
D5    0.157303  0.198198  0.180
All   1.000000  1.000000  1.000

### Reseting Index
- When creating a crosstab, **column specified by index** will become index  
- To convert it to normal column, use **reset_index()**
```
DataFrameObj.reset_index( inpalce=False )
```

In [208]:
tb.reset_index()

grp dept  G1   G2  All
0     D1  16   18   34
1     D2  20   19   39
2     D3  16   24   40
3     D4  23   28   51
4     D5  14   22   36
5    All  89  111  200

## Group and Aggregation
- Aggretation and summarization require creating **DataFrameGroupBy** object from existing DataFrame  
- The **GroupBy** object is a **very flexible abstraction**. In many ways, you can simply treat it as if it's a **collection of DataFrames**, and it does the difficult things under the hood

In [209]:
company = pd.read_csv('data/company.csv')
company.head()

  Company Department      Name  Age  Salary  Birthdate
0      C1         D1      Yong   45   15000   1/1/1970
1      C1         D1      Chew   35   12000   2/1/1980
2      C1         D2       Lim   34    8000  2/19/1977
3      C1         D3     Jessy   23    2500  3/15/1990
4      C1         D3  Hoi Ming   55   25000  4/15/1987

### Creating Groups

In [210]:
com_grp = company.groupby(['Company','Department'])

In [211]:
com_grp

### Properties

#### Number of Groups Created

In [212]:
com_grp.ngroups

9

#### Row Numbers Associated For Each Group

In [213]:
com_grp.groups  # return Dictionary

{('C1', 'D1'): Int64Index([0, 1], dtype='int64'),
 ('C1', 'D2'): Int64Index([2], dtype='int64'),
 ('C1', 'D3'): Int64Index([3, 4, 5], dtype='int64'),
 ('C2', 'D1'): Int64Index([6], dtype='int64'),
 ('C2', 'D2'): Int64Index([7, 8, 9], dtype='int64'),
 ('C2', 'D3'): Int64Index([10, 11, 12], dtype='int64'),
 ('C3', 'D1'): Int64Index([14], dtype='int64'),
 ('C3', 'D2'): Int64Index([15], dtype='int64'),
 ('C3', 'D3'): Int64Index([13, 16, 17], dtype='int64')}

### Methods

#### Number of Rows In Each Group

In [214]:
com_grp.size()  # return panda Series object

Company  Department
C1       D1            2
         D2            1
         D3            3
C2       D1            1
         D2            3
         D3            3
C3       D1            1
         D2            1
         D3            3
dtype: int64

#### Valid (not Null) Data Count For Each Fields In The Group

In [215]:
com_grp.count()  # return panda DataFrame object

                    Name  Age  Salary  Birthdate
Company Department
C1      D1             2    2       2          2
        D2             1    1       1          1
        D3             3    3       3          3
C2      D1             1    1       1          1
        D2             3    3       3          3
        D3             3    3       3          3
C3      D1             1    1       1          1
        D2             1    1       1          1
        D3             3    3       3          3

### Retrieve Rows
All row retrieval operations **return a dataframe**

#### Retrieve N Rows For Each Groups
Example below retrieve 2 rows from each group

In [216]:
com_grp.head(2)

   Company Department      Name  Age  Salary   Birthdate
0       C1         D1      Yong   45   15000    1/1/1970
1       C1         D1      Chew   35   12000    2/1/1980
2       C1         D2       Lim   34    8000   2/19/1977
3       C1         D3     Jessy   23    2500   3/15/1990
4       C1         D3  Hoi Ming   55   25000   4/15/1987
..     ...        ...       ...  ...     ...         ...
11      C2         D3   Jeannie   30   12500  12/31/1980
13      C3         D3     Chang   32    7900   7/26/1973
14      C3         D1       Ong   44   17500   8/21/1980
15      C3         D2      Lily   41   15300   7/17/1990
16      C3         D3     Sally   54   21000   7/19/1968

[14 rows x 6 columns]

#### Retrieve Rows In One Specific Group

In [217]:
com_grp.get_group(('C1','D3'))

  Company Department      Name  Age  Salary  Birthdate
3      C1         D3     Jessy   23    2500  3/15/1990
4      C1         D3  Hoi Ming   55   25000  4/15/1987
5      C1         D3   Sui Wei   56    3000  6/15/1990

#### Retrieve n-th Row From Each Group
Row number is 0-based

In [218]:
com_grp.nth(-1)    # retireve last row from each group

                    Age   Birthdate     Name  Salary
Company Department
C1      D1           35    2/1/1980     Chew   12000
        D2           34   2/19/1977      Lim    8000
        D3           56   6/15/1990  Sui Wei    3000
C2      D1           18   7/15/1997     Anne     400
        D2           46  10/31/1988    Jimmy   14000
        D3           29   12/1/1963  Bernard    9800
C3      D1           44   8/21/1980      Ong   17500
        D2           41   7/17/1990     Lily   15300
        D3           37   3/16/1969   Esther   13500

### Iteration
**DataFrameGroupBy** object can be thought as a collection of named groups

In [219]:
def print_groups (g):
    for name,group in g:
        print (name)
        print (group[:2])
        
print_groups (com_grp)

('C1', 'D1')
  Company Department  Name  Age  Salary Birthdate
0      C1         D1  Yong   45   15000  1/1/1970
1      C1         D1  Chew   35   12000  2/1/1980
('C1', 'D2')
  Company Department Name  Age  Salary  Birthdate
2      C1         D2  Lim   34    8000  2/19/1977
('C1', 'D3')
  Company Department      Name  Age  Salary  Birthdate
3      C1         D3     Jessy   23    2500  3/15/1990
4      C1         D3  Hoi Ming   55   25000  4/15/1987
('C2', 'D1')
  Company Department  Name  Age  Salary  Birthdate
6      C2         D1  Anne   18     400  7/15/1997
('C2', 'D2')
  Company Department     Name  Age  Salary  Birthdate
7      C2         D2  Deborah   30    8600  8/15/1984
8      C2         D2  Nikalus   51   12000  9/18/2000
('C2', 'D3')
   Company Department     Name  Age  Salary   Birthdate
10      C2         D3  Michael   38   17000  11/30/1997
11      C2         D3  Jeannie   30   12500  12/31/1980
('C3', 'D1')
   Company Department Name  Age  Salary  Birthdate
14      C3         D1  Ong   44   17500  8/21/1980
('C3', 'D2')
   Company Department  Name  Age  Salary  Birthdate
15      C3         D2  Lily   41   15300  7/17/1990
('C3', 'D3')
   Company Department   Name  Age  Salary  Birthdate
13      C3         D3  Chang   32    7900  7/26/1973
16      C3         D3  Sally   54   21000  7/19/1968

In [220]:
com_grp

### Apply Aggregate Functions to Groups
Aggregate apply functions to columns in every groups, and return a summary data for each group

#### Apply One Function to One or More Columns

In [221]:
com_grp['Age'].sum()

Company  Department
C1       D1             80
         D2             34
         D3            134
C2       D1             18
         D2            127
         D3             97
C3       D1             44
         D2             41
         D3            123
Name: Age, dtype: int64

In [222]:
com_grp[['Age','Salary']].sum()

                    Age  Salary
Company Department
C1      D1           80   27000
        D2           34    8000
        D3          134   30500
C2      D1           18     400
        D2          127   34600
        D3           97   39300
C3      D1           44   17500
        D2           41   15300
        D3          123   42400

#### Apply One or More Functions To All Columns

In [223]:
com_grp.agg(np.mean)

                          Age        Salary
Company Department
C1      D1          40.000000  13500.000000
        D2          34.000000   8000.000000
        D3          44.666667  10166.666667
C2      D1          18.000000    400.000000
        D2          42.333333  11533.333333
        D3          32.333333  13100.000000
C3      D1          44.000000  17500.000000
        D2          41.000000  15300.000000
        D3          41.000000  14133.333333

In [224]:
com_grp.agg([np.mean,np.sum])

                          Age             Salary
                         mean  sum          mean    sum
Company Department
C1      D1          40.000000   80  13500.000000  27000
        D2          34.000000   34   8000.000000   8000
        D3          44.666667  134  10166.666667  30500
C2      D1          18.000000   18    400.000000    400
        D2          42.333333  127  11533.333333  34600
        D3          32.333333   97  13100.000000  39300
C3      D1          44.000000   44  17500.000000  17500
        D2          41.000000   41  15300.000000  15300
        D3          41.000000  123  14133.333333  42400

#### Apply Different Functions To Different Columns

In [225]:
com_grp.agg({'Age':np.mean, 'Salary': [np.min,np.max]})

                          Age Salary
                         mean   amin   amax
Company Department
C1      D1          40.000000  12000  15000
        D2          34.000000   8000   8000
        D3          44.666667   2500  25000
C2      D1          18.000000    400    400
        D2          42.333333   8600  14000
        D3          32.333333   9800  17000
C3      D1          44.000000  17500  17500
        D2          41.000000  15300  15300
        D3          41.000000   7900  21000

### Transform

- Transform is an operation used combined with **DataFrameGroupBy** object  
- **transform()** return a **new DataFrame object**

In [226]:
grp = company.groupby('Company')
grp.size()

Company
C1    6
C2    7
C3    5
dtype: int64

**transform()** perform a function to a group, and **expands and replicate** it to multiple rows according to original DataFrame

In [227]:
grp[['Age','Salary']].transform('sum')

    Age  Salary
0   248   65500
1   248   65500
2   248   65500
3   248   65500
4   248   65500
..  ...     ...
13  208   75200
14  208   75200
15  208   75200
16  208   75200
17  208   75200

[18 rows x 2 columns]

In [228]:
grp.transform( lambda x:x+10 )

    Age  Salary
0    55   15010
1    45   12010
2    44    8010
3    33    2510
4    65   25010
..  ...     ...
13   42    7910
14   54   17510
15   51   15310
16   64   21010
17   47   13510

[18 rows x 2 columns]

## Concat

### Sample Data

In [248]:
s1 = pd.Series(['A1','A2','A3','A4'])
s2 = pd.Series(['B1','B2','B3','B4'])
s3 = pd.Series(['C1','C2','C3','C4'])
df = pd.DataFrame({ 'A': s1, 'B': s2})
df

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

### Column-Wise

#### Multiple Arrays/Series
- Added series will have 0,1,2,... column names

In [257]:
pd.concat([s1,s2,s3],axis=1)

    0   1   2
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
3  A4  B4  C4

#### DataFrame and Series
- No change to original data frame column name
- Added columns from series will have 0,1,2,3,.. column name

In [259]:
pd.concat([df,s3,s1],axis=1)

    A   B   0   1
0  A1  B1  C1  A1
1  A2  B2  C2  A2
2  A3  B3  C3  A3
3  A4  B4  C4  A4

### Row-Wise

## Fundamental Analysis

### Structure of the Dataframe (.info())
**info()** is a function that print information to screen. It doesn't return any object
```
dataframe.info()  # display columns and number of rows (that has no missing data)
```

In [229]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
Currency      11 non-null object
Value         11 non-null float64
Change        11 non-null float64
Net Change    11 non-null object
Time (EDT)    11 non-null object
2 Day         0 non-null float64
dtypes: float64(3), object(3)
memory usage: 608.0+ bytes

### First Few Rows (.head())
```
dataframe.head (n) # return dataframe of first n rows, default n = 5
```

In [230]:
df.head()

  Currency     Value  Change Net Change Time (EDT)  2 Day
0  EUR-USD    1.2301  0.0031     +0.25%   11:00 AM    NaN
1  USD-JPY  106.5400 -0.0700     -0.07%   11:00 AM    NaN
2  GBP-USD    1.4084  0.0027     +0.19%   11:00 AM    NaN
3  AUD-USD    0.7701  0.0016     +0.21%   11:00 AM    NaN
4  USD-CAD    1.2821  0.0014     +0.11%   11:00 AM    NaN

## Missing Data

### What Is Considered Missing Data ?

### Sample Data

In [231]:
df = pd.DataFrame( np.random.randn(5, 3), 
                   index   =['a', 'c', 'e', 'f', 'h'],
                   columns =['one', 'two', 'three'])
df['four'] = 'bar'
df['five'] = df['one'] > 0
df
df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

        one       two     three four   five
a  0.366083 -0.690501 -0.736248  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -0.607350  0.800183 -0.412550  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.684213 -0.148327 -1.432006  bar   True
f  0.469932  0.420283  0.586002  bar   True
g       NaN       NaN       NaN  NaN    NaN
h -1.700706 -0.289902 -1.803585  bar  False

**How Missing Data For Each Column ?**

In [232]:

df.count()

one      5
two      5
three    5
four     5
five     5
dtype: int64

In [233]:
len(df.index) - df.count()

one      0
two      0
three    0
four     0
five     0
dtype: int64

In [234]:
df.isnull()

     one    two  three   four   five
a  False  False  False  False  False
c  False  False  False  False  False
e  False  False  False  False  False
f  False  False  False  False  False
h  False  False  False  False  False

In [235]:
df.describe()

            one       two     three
count  5.000000  5.000000  5.000000
mean  -0.157566  0.018347 -0.759677
std    0.995005  0.591203  0.931889
min   -1.700706 -0.690501 -1.803585
25%   -0.607350 -0.289902 -1.432006
50%    0.366083 -0.148327 -0.736248
75%    0.469932  0.420283 -0.412550
max    0.684213  0.800183  0.586002